[
    "recommendation-recommendation_movies+movie_type",
    "social-social_post+relation",
    "play-play_podcasts+person",
    "recommendation-recommendation_events+business_type",
    "qa-qa_currency+place_name",
    "email-email_sendemail+general_frequency",
    "calendar-calendar_set+house_place",
    "datetime-datetime_convert+time",
    "play-play_podcasts+transport_type",
    "social-social_post+media_type",
    "alarm-alarm_set+relation",
    "email-email_query+place_name",
    "transport-transport_query+transport_descriptor",
    "iot-iot_hue_lightup+house_place",
    "calendar-calendar_query+time",
    "transport-transport_ticket+date",
    "news-news_query+time",
    "lists-lists_createoradd+drink_type",
    "calendar-calendar_set+timeofday",
    "recommendation-recommendation_events+event_name",
    "social-social_query+date",
    "takeaway-takeaway_order+time",
    "lists-lists_createoradd+event_name",
    "play-play_podcasts+timeofday",
    "music-music_query+artist_name",
    "calendar-calendar_query+relation",
    "transport-transport_query+app_name",
    "general-general_quirky+event_name",
    "email-email_query+person",
    "weather-weather_query+place_name",
    "alarm-alarm_set+time",
    "qa-qa_definition+definition_word",
    "calendar-calendar_query+business_name",
    "datetime-datetime_query+time",
    "music-music_likeness+playlist_name",
    "recommendation-recommendation_movies+business_type",
    "email-email_addcontact+email_address",
    "play-play_podcasts+podcast_descriptor",
    "iot-iot_hue_lightchange+house_place",
    "play-play_podcasts+date",
    "alarm-alarm_remove+date",
    "transport-transport_taxi+transport_name",
    "alarm-alarm_query+date",
    "calendar-calendar_query+sport_type",
    "email-email_querycontact+place_name",
    "iot-iot_hue_lightup+device_type",
    "iot-iot_cleaning+device_type",
    "transport-transport_ticket+currency_name",
    "recommendation-recommendation_locations+meal_type",
    "alarm-alarm_remove+time",
    "iot-iot_hue_lightoff+house_place",
    "takeaway-takeaway_order+timeofday",
    "qa-qa_factoid+news_topic",
    "iot-iot_coffee+timeofday",
    "general-general_quirky+food_type",
    "transport-transport_query+event_name",
    "general-general_quirky+drink_type",
    "music-music_likeness+player_setting",
    "iot-iot_cleaning+place_name",
    "play-play_audiobook+media_type",
    "lists-lists_createoradd+music_descriptor",
    "news-news_query+device_type",
    "cooking-cooking_query+food_type",
    "transport-transport_query+timeofday",
    "lists-lists_remove+timeofday",
    "email-email_addcontact+business_name",
    "music-music_likeness+event_name",
    "transport-transport_ticket+time",
    "play-play_music+app_name",
    "transport-transport_traffic+date",
    "cooking-cooking_recipe+media_type",
    "play-play_music+song_name",
    "social-social_post+weather_descriptor",
    "iot-iot_hue_lighton+house_place",
    "social-social_post+device_type",
    "recommendation-recommendation_locations+drink_type",
    "email-email_sendemail+person",
    "email-email_sendemail+meal_type",
    "qa-qa_stock+news_topic",
    "news-news_query+date",
    "general-general_quirky+business_type",
    "general-general_quirky+meal_type",
    "lists-lists_createoradd+person",
    "iot-iot_hue_lightdim+change_amount",
    "general-general_quirky+place_name",
    "cooking-cooking_recipe+device_type",
    "music-music_dislikeness+music_descriptor",
    "general-general_quirky+general_frequency",
    "play-play_radio+radio_name",
    "datetime-datetime_convert+timeofday",
    "calendar-calendar_set+media_type",
    "transport-transport_query+date",
    "weather-weather_query+food_type",
    "transport-transport_taxi+transport_type",
    "takeaway-takeaway_order+date",
    "cooking-cooking_recipe+ingredient",
    "takeaway-takeaway_query+business_name",
    "recommendation-recommendation_events+timeofday",
    "recommendation-recommendation_locations+date",
    "iot-iot_wemo_off+device_type",
    "datetime-datetime_query+time_zone",
    "audio-audio_volume_mute+device_type",
    "calendar-calendar_set+song_name",
    "play-play_podcasts+media_type",
    "email-email_query+time",
    "takeaway-takeaway_query+business_type",
    "alarm-alarm_set+time_zone",
    "recommendation-recommendation_movies+place_name",
    "social-social_query+relation",
    "alarm-alarm_query+alarm_type",
    "transport-transport_taxi+business_type",
    "qa-qa_maths+general_frequency",
    "recommendation-recommendation_locations+time",
    "email-email_query+personal_info",
    "cooking-cooking_recipe+cooking_type",
    "cooking-cooking_recipe+business_name",
    "calendar-calendar_set+personal_info",
    "qa-qa_stock+time",
    "music-music_settings+artist_name",
    "calendar-calendar_remove+time",
    "play-play_audiobook+song_name",
    "iot-iot_hue_lightoff+device_type",
    "cooking-cooking_recipe+date",
    "lists-lists_query+device_type",
    "email-email_sendemail+timeofday",
    "music-music_query+music_genre",
    "music-music_query+music_album",
    "lists-lists_remove+list_name",
    "transport-transport_traffic+time",
    "news-news_query+transport_type",
    "cooking-cooking_recipe+meal_type",
    "social-social_query+media_type",
    "qa-qa_factoid+artist_name",
    "calendar-calendar_remove+place_name",
    "transport-transport_query+relation",
    "iot-iot_coffee+time",
    "play-play_radio+house_place",
    "audio-audio_volume_up+device_type",
    "datetime-datetime_convert+time_zone",
    "transport-transport_traffic+event_name",
    "iot-iot_hue_lightup+change_amount",
    "general-general_quirky+device_type",
    "general-general_quirky+person",
    "cooking-cooking_recipe+list_name",
    "music-music_query+media_type",
    "lists-lists_remove+song_name",
    "general-general_quirky+timeofday",
    "calendar-calendar_remove+general_frequency",
    "calendar-calendar_remove+app_name",
    "qa-qa_maths+date",
    "email-email_querycontact+person",
    "qa-qa_currency+date",
    "cooking-cooking_query+meal_type",
    "transport-transport_taxi+app_name",
    "datetime-datetime_query+timeofday",
    "social-social_post+place_name",
    "weather-weather_query+time",
    "transport-transport_taxi+person",
    "audio-audio_volume_up+change_amount",
    "play-play_game+game_name",
    "alarm-alarm_query+event_name",
    "alarm-alarm_remove+alarm_type",
    "play-play_music+media_type",
    "calendar-calendar_remove+timeofday",
    "email-email_sendemail+artist_name",
    "qa-qa_factoid+place_name",
    "recommendation-recommendation_movies+time",
    "cooking-cooking_recipe+food_type",
    "general-general_joke+business_type",
    "transport-transport_query+place_name",
    "lists-lists_remove+person",
    "play-play_game+game_type",
    "audio-audio_volume_up+media_type",
    "music-music_query+timeofday",
    "play-play_music+date",
    "transport-transport_query+transport_name",
    "play-play_radio+person",
    "lists-lists_query+music_genre",
    "calendar-calendar_remove+meal_type",
    "calendar-calendar_set+business_name",
    "recommendation-recommendation_events+date",
    "email-email_sendemail+date",
    "calendar-calendar_set+artist_name",
    "audio-audio_volume_up+song_name",
    "weather-weather_query+event_name",
    "takeaway-takeaway_query+place_name",
    "calendar-calendar_query+meal_type",
    "lists-lists_createoradd+general_frequency",
    "recommendation-recommendation_locations+place_name",
    "play-play_audiobook+time",
    "iot-iot_hue_lightoff+time",
    "music-music_likeness+date",
    "iot-iot_hue_lightchange+color_type",
    "lists-lists_query+date",
    "iot-iot_coffee+coffee_type",
    "social-social_query+person",
    "audio-audio_volume_mute+time",
    "general-general_joke+food_type",
    "music-music_likeness+music_descriptor",
    "transport-transport_taxi+date",
    "lists-lists_remove+date",
    "music-music_dislikeness+music_genre",
    "qa-qa_stock+business_name",
    "qa-qa_stock+currency_name",
    "audio-audio_volume_other+change_amount",
    "transport-transport_traffic+timeofday",
    "recommendation-recommendation_events+place_name",
    "email-email_query+date",
    "email-email_addcontact+person",
    "social-social_query+event_name",
    "transport-transport_taxi+timeofday",
    "takeaway-takeaway_query+timeofday",
    "alarm-alarm_set+media_type",
    "play-play_radio+app_name",
    "cooking-cooking_recipe+app_name",
    "lists-lists_query+list_name",
    "play-play_radio+device_type",
    "email-email_sendemail+personal_info",
    "social-social_query+general_frequency",
    "recommendation-recommendation_locations+food_type",
    "social-social_post+business_name",
    "music-music_likeness+song_name",
    "transport-transport_taxi+transport_agency",
    "play-play_radio+music_genre",
    "takeaway-takeaway_order+ingredient",
    "qa-qa_factoid+event_name",
    "email-email_querycontact+date",
    "lists-lists_createoradd+list_name",
    "qa-qa_stock+person",
    "general-general_joke+joke_type",
    "recommendation-recommendation_locations+business_type",
    "iot-iot_hue_lightchange+change_amount",
    "news-news_query+timeofday",
    "alarm-alarm_remove+person",
    "transport-transport_taxi+time",
    "iot-iot_coffee+business_type",
    "qa-qa_stock+date",
    "play-play_podcasts+place_name",
    "lists-lists_createoradd+relation",
    "weather-weather_query+general_frequency",
    "iot-iot_hue_lightoff+color_type",
    "email-email_querycontact+media_type",
    "email-email_query+event_name",
    "takeaway-takeaway_order+business_name",
    "music-music_settings+player_setting",
    "play-play_music+timeofday",
    "general-general_joke+person",
    "lists-lists_remove+event_name",
    "play-play_music+player_setting",
    "takeaway-takeaway_query+event_name",
    "email-email_querycontact+relation",
    "play-play_radio+media_type",
    "alarm-alarm_set+alarm_type",
    "transport-transport_query+food_type",
    "email-email_sendemail+event_name",
    "qa-qa_factoid+list_name",
    "transport-transport_ticket+transport_descriptor",
    "alarm-alarm_set+general_frequency",
    "iot-iot_hue_lightchange+time",
    "play-play_audiobook+audiobook_author",
    "email-email_sendemail+business_name",
    "music-music_likeness+music_genre",
    "lists-lists_createoradd+place_name",
    "email-email_query+business_name",
    "general-general_joke+date",
    "calendar-calendar_set+business_type",
    "cooking-cooking_recipe+timeofday",
    "calendar-calendar_remove+business_type",
    "email-email_sendemail+email_folder",
    "play-play_audiobook+date",
    "play-play_audiobook+artist_name",
    "calendar-calendar_set+date",
    "calendar-calendar_remove+person",
    "email-email_sendemail+time",
    "iot-iot_cleaning+time",
    "alarm-alarm_set+person",
    "audio-audio_volume_mute+date",
    "lists-lists_query+business_name",
    "email-email_querycontact+personal_info",
    "general-general_quirky+movie_name",
    "iot-iot_hue_lighton+device_type",
    "calendar-calendar_set+time",
    "qa-qa_factoid+food_type",
    "qa-qa_factoid+movie_name",
    "transport-transport_taxi+place_name",
    "transport-transport_traffic+place_name",
    "music-music_query+song_name",
    "music-music_likeness+app_name",
    "iot-iot_hue_lightdim+house_place",
    "transport-transport_ticket+relation",
    "iot-iot_hue_lightchange+player_setting",
    "weather-weather_query+timeofday",
    "play-play_podcasts+player_setting",
    "takeaway-takeaway_order+food_type",
    "transport-transport_ticket+app_name",
    "play-play_music+music_genre",
    "calendar-calendar_set+general_frequency",
    "recommendation-recommendation_events+meal_type",
    "alarm-alarm_query+house_place",
    "social-social_post+business_type",
    "alarm-alarm_remove+timeofday",
    "email-email_sendemail+place_name",
    "lists-lists_query+person",
    "calendar-calendar_remove+list_name",
    "play-play_radio+time",
    "takeaway-takeaway_order+drink_type",
    "calendar-calendar_query+person",
    "play-play_music+playlist_name",
    "alarm-alarm_set+date",
    "transport-transport_query+business_name",
    "general-general_quirky+date",
    "audio-audio_volume_mute+change_amount",
    "takeaway-takeaway_order+business_type",
    "takeaway-takeaway_query+time",
    "transport-transport_taxi+event_name",
    "email-email_query+email_folder",
    "transport-transport_taxi+business_name",
    "play-play_music+movie_name",
    "music-music_query+person",
    "iot-iot_cleaning+date",
    "recommendation-recommendation_movies+date",
    "iot-iot_coffee+date",
    "transport-transport_ticket+place_name",
    "social-social_post+date",
    "qa-qa_factoid+time",
    "datetime-datetime_query+place_name",
    "iot-iot_cleaning+house_place",
    "play-play_radio+timeofday",
    "takeaway-takeaway_query+order_type",
    "audio-audio_volume_down+device_type",
    "transport-transport_ticket+transport_name",
    "datetime-datetime_query+event_name",
    "music-music_settings+media_type",
    "transport-transport_query+person",
    "general-general_quirky+time",
    "general-general_quirky+news_topic",
    "alarm-alarm_query+timeofday",
    "calendar-calendar_remove+transport_type",
    "transport-transport_query+time",
    "lists-lists_query+timeofday",
    "iot-iot_hue_lightdim+device_type",
    "recommendation-recommendation_events+time",
    "general-general_quirky+artist_name",
    "calendar-calendar_set+person",
    "qa-qa_currency+business_name",
    "calendar-calendar_set+event_name",
    "social-social_post+event_name",
    "lists-lists_createoradd+time",
    "music-music_settings+device_type",
    "iot-iot_hue_lightdim+color_type",
    "play-play_radio+relation",
    "datetime-datetime_query+date",
    "play-play_music+artist_name",
    "lists-lists_remove+meal_type",
    "lists-lists_createoradd+date",
    "play-play_podcasts+time",
    "news-news_query+news_topic",
    "play-play_audiobook+player_setting",
    "takeaway-takeaway_order+app_name",
    "cooking-cooking_recipe+drink_type",
    "qa-qa_factoid+person",
    "lists-lists_query+event_name",
    "music-music_likeness+artist_name",
    "calendar-calendar_remove+event_name",
    "recommendation-recommendation_movies+movie_name",
    "email-email_querycontact+device_type",
    "general-general_joke+relation",
    "social-social_query+time",
    "email-email_query+timeofday",
    "recommendation-recommendation_events+business_name",
    "email-email_sendemail+email_address",
    "iot-iot_cleaning+general_frequency",
    "iot-iot_wemo_on+device_type",
    "alarm-alarm_remove+event_name",
    "qa-qa_factoid+music_genre",
    "recommendation-recommendation_locations+business_name",
    "datetime-datetime_convert+person",
    "play-play_radio+date",
    "social-social_query+news_topic",
    "play-play_podcasts+radio_name",
    "recommendation-recommendation_movies+business_name",
    "email-email_addcontact+place_name",
    "qa-qa_factoid+date",
    "email-email_sendemail+relation",
    "transport-transport_query+transport_type",
    "qa-qa_currency+currency_name",
    "email-email_query+relation",
    "takeaway-takeaway_order+order_type",
    "audio-audio_volume_down+change_amount",
    "email-email_addcontact+list_name",
    "general-general_quirky+media_type",
    "music-music_query+date",
    "play-play_music+music_album",
    "music-music_settings+music_genre",
    "datetime-datetime_convert+place_name",
    "play-play_game+device_type",
    "cooking-cooking_recipe+time",
    "play-play_podcasts+podcast_name",
    "alarm-alarm_set+event_name",
    "music-music_settings+music_descriptor",
    "weather-weather_query+meal_type",
    "play-play_audiobook+app_name",
    "lists-lists_remove+place_name",
    "cooking-cooking_recipe+event_name",
    "weather-weather_query+business_type",
    "alarm-alarm_remove+relation",
    "lists-lists_query+app_name",
    "takeaway-takeaway_query+person",
    "recommendation-recommendation_movies+timeofday",
    "alarm-alarm_set+order_type",
    "recommendation-recommendation_movies+media_type",
    "news-news_query+person",
    "email-email_querycontact+list_name",
    "transport-transport_ticket+transport_type",
    "email-email_querycontact+event_name",
    "recommendation-recommendation_movies+event_name",
    "takeaway-takeaway_query+food_type",
    "calendar-calendar_query+event_name",
    "music-music_settings+song_name",
    "play-play_music+time",
    "takeaway-takeaway_order+meal_type",
    "recommendation-recommendation_events+movie_type",
    "iot-iot_coffee+business_name",
    "music-music_query+player_setting",
    "news-news_query+media_type",
    "music-music_settings+app_name",
    "recommendation-recommendation_events+personal_info",
    "calendar-calendar_set+meal_type",
    "general-general_quirky+relation",
    "transport-transport_query+business_type",
    "news-news_query+general_frequency",
    "email-email_addcontact+personal_info",
    "email-email_querycontact+business_name",
    "social-social_post+personal_info",
    "play-play_radio+music_descriptor",
    "weather-weather_query+date",
    "audio-audio_volume_mute+event_name",
    "email-email_addcontact+relation",
    "calendar-calendar_set+relation",
    "calendar-calendar_remove+date",
    "music-music_likeness+place_name",
    "play-play_audiobook+audiobook_name",
    "iot-iot_wemo_on+house_place",
    "play-play_music+device_type",
    "calendar-calendar_set+place_name",
    "lists-lists_remove+relation",
    "iot-iot_wemo_off+house_place",
    "email-email_querycontact+time",
    "takeaway-takeaway_query+meal_type",
    "play-play_music+music_descriptor",
    "datetime-datetime_query+food_type",
    "alarm-alarm_query+device_type",
    "audio-audio_volume_mute+timeofday",
    "transport-transport_ticket+timeofday",
    "weather-weather_query+weather_descriptor",
    "calendar-calendar_query+date",
    "general-general_greet+date",
    "calendar-calendar_set+sport_type",
    "calendar-calendar_query+place_name",
    "news-news_query+place_name",
    "alarm-alarm_query+time",
    "calendar-calendar_remove+relation",
    "alarm-alarm_set+timeofday",
    "iot-iot_coffee+device_type",
    "calendar-calendar_query+list_name",
    "calendar-calendar_query+timeofday",
    "social-social_post+person",
    "calendar-calendar_query+general_frequency"
]